<?php

//================================
// ログ
//================================
//ログを取るか
ini_set('log_errors', 'on');
//ログの出力ファイルを指定
ini_set('error_log', 'logs/php.log');

//================================
// デバッグ
//================================
//デバッグフラグ
$debug_flg = true;

//デバッグログ関数
function debug($str)
{
    global $debug_flg;
    if (!empty($debug_flg)) {
        error_log($str);
    }
}

//================================
// エラーメッセージ用の定数
//================================
define('MSG01', '入力必須です。');
define('MSG02', 'Emailの形式で入力してください。');


// エラーメッセージ格納用の配列
$err_msg = [];

/****************************************
バリデーションチェック関数
*****************************************/
// 未入力チェック
function validRequire($str, $key)
{
    if ($str === '') {
        global $err_msg;
        $err_msg[$key] = MSG01;
    }
}


/****************************************
その他
*****************************************/
function sanitize($str)
{
    return htmlspecialchars($str, ENT_QUOTES, 'UTF-8');
}
